02. Rails with Active Record and Action Pack/Module 3/todolists/app/controllers/todo_items_controller.rb

  def index
    @todo_items = TodoItem.all
---
SELECT "todo_items".* FROM "todo_items"

  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save
---
INSERT INTO "todo_items" ("title", "description", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Ryan Dsouza"], ["description", "Studying Desing and Rails"], ["due_date", "2015-04-15"], ["created_at", "2018-07-07 16:28:08.851669"], ["updated_at", "2018-07-07 16:28:08.851669"]]

  def update

    respond_to do |format|
      if @todo_item.update(todo_item_params)
---
UPDATE "todo_items" SET "description" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["description", "Hello"], ["updated_at", "2018-07-07 16:52:42.675350"], ["id", 5]]

  def destroy
    @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]

    def set_todo_item
      @todo_item = TodoItem.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", 5]]